Repository: miller-alex/kding
Catalog: po/*/kding.po
Languages: cs, de

source: How the window should be placed on the desktop
cs: Jakým způsobem má být okno umístěno na ploše

source: Position of the application window
cs: Poloha okna s programem
de: Position des Fensters

source: Should a left click on the system tray icon translate the clipboard content?
cs: Má klepnutí na symbol ikony v systémové oblasti panelu stisknutím levého tlačítka myši přeložit obsah schránky?
de: Soll ein Linksklick auf das Symbol im Systembereich den Inhalt der Zwischenablage übersetzen?

source: Decides whether to start the translation or to show the main window after a left click on the system tray icon.
cs: Určuje, zda se po klepnutí na symbol ikony v systémové oblasti panelu stisknutím levého tlačítka myši přeloží obsah schránky, nebo se ukáže pouze hlavní okno
de: Legt fest, ob bei einem Linksklick auf das Symbol im Systembereich der Kontrollleiste die Übersetzung angestoßen oder nur das Hauptfenster angezeigt werden soll.

source: If this is enabled, translation will start when the user clicks the system tray icon with the left mouse button, and the applications window will be shown when the icon is clicked with the middle mouse button. Otherwise, it's the other way round.
cs: Jestliže je povolena tato volba, překlad začne, když uživatel klepne za stisknutí levého tlačítka myši na symbol ikony v systémové oblasti panelu, a hlavní okno se ukáže, když bude na ikonu poklepáno prostředním tlačítkem myši. V opačném případě jsou reakce na klepnutí na symbol obráceně.
de: Wenn diese Option aktiviert ist, wird die Übersetzung angestoßen wenn der Benutzer mit der linken Maustaste auf das Symbol im Systembereich der Kontrollleiste klickt, und das Hauptfenster wird angezeigt, wenn mit der mittleren Maustaste auf das Symbol geklickt wird. Andernfalls sind die Reaktionen auf einen Klick auf das Symbol andersherum.

source: What backend to use for dictionary lookups?
cs: Který program se má používat pro hledání ve slovníku?
de: Welches Programm soll zur Wörterbuchsuche verwendet werden?

source: This selects the backend to use for dictionary lookups.
cs: Tímto se vybere program, který se použije pro hledání ve slovníku
de: Hiermit wird das Programm ausgewählt, das zur Wörterbuchsuche verwendet wird.

source: This option determines the program that is used to search the dictionary. egrep is a standard tool that should be installed on every system and supports basic searching. agrep is an advanced tool which supports approximate matching and thus enables KDing to find a phrase even when it is misspelled. When using agrep, you can set the number of errors permitted in the "Advanced Options" section.
cs: Touto volbou se určí program, se kterým se bude slovník prohledávat. Egrep je obvyklým nástrojem, který by měl být instalován na každém systémua nabízí základní vyhledávací funkce. Agrep je pokročilým nástrojem, který umožňuje vyhledávání podobných slov. Tímto je pro KDing možné najít výraz i tehdy, když obsahuje chybu pravopisnou chybu. Používate-liagrep můžete stanovit počet dovolených chyb v oddíle"Rozšířené volby".
de: Diese Option legt das Programm fest, mit dem das Wörterbuch durchsucht wird. egrep ist ein Standardwerkzeug, das auf jedem System installiert sein sollte und grundlegende Suchfunktionen bietet. agrep ist ein erweitertes Werkzeug, das die Suche nach ähnlichen Wörtern ermöglicht. Damit ist es KDing möglich einen Ausdruck auch dann zu finden, wenn er Schreibfehler enthält. Wenn Sie agrep benutzen, können sie die Anzahl der erlaubten Fehler im Abschnitt "Erweiterte Optionen" festlegen.

source: Should the search be case-sensitive?
cs: Má se při hledání brát zřetel na psaní velkých a malých písmen?
de: Soll bei der Suche die Groß-/Kleinschreibung beachtet werden?

source: Decides whether case will be considered when searching for a term.
cs: Určuje, zda se při hledání pojmu bude brát zřetel na psaní velkých a malých písmen.
de: Legt fest, ob beim Suchen die Groß-/Kleinschreibung beachtet wird.

source: Should the search match only whole words or also partial strings?
cs: Mají se nacházet pouze celá slova, nebo i taková, u kterých je hledaný pojem částí slova?
de: Sollen nur ganze Wörter gefunden werden oder auch solche, bei denen der Suchbegriff ein Teil des Wortes ist?

source: Decides whether the search term must match a whole word or can be a part of a word.
cs: Určuje, zda se nacházejí pouze taková slova, která přesně odpovídají hledanému pojmu, nebo zda hledaný pojem může být částí slova.
de: Legt fest, ob nur Wörter gefunden werden, die exakt dem Suchbegriff entsprechen, oder ob der Suchbegriff auch nur ein Teil eines Wortes sein kann.

source: If this is enabled, the search term will match only whole words. If it is disabled, the search term can also be a part of a word.
cs: Když je povolena tato volba, budou se nacházet pouze záznamy, u kterých slovo odpovídá přesně hledanému pojmu. Když není povolena, budou se nacházet i záznamy, u kterých je hledaný pojem jen částí slova.
de: Wenn diese Option aktiviert ist, werden nur Eintrage gefunden, bei denen ein Wort exakt dem Suchbegriff entspricht. Wenn sie nicht aktiviert ist, werden auch Einträge gefunden, bei denen der Suchbegriff nur einen Teil eines Wortes bildet.

source: How many errors are permitted when doing an approximate search?
cs: Kolik chyb je dovoleno, když se provádí přibližné vyhledávání?
de: Wie viele Fehler sind erlaubt, wenn eine annäherungsweise Suche durchgeführt wird?

source: List of recently translated words
cs: Seznam v poslední době přeložených slov
de: Liste der zuletzt übersetzten Wörter

source: Backend
cs: Program

source: Search Command
cs: Příkaz pro hledání

source: Basic search (egrep)
cs: Jednoduché hledání (egrep)
de: Einfache Suche (egrep)

source: Advanced search (agrep)
cs: Rozšířené hledání (agrep)
de: Erweiterte Suche (agrep)

source: Basic Options
cs: Jednoduché volby
de: Allgemeine Optionen

source: Match whole words only
cs: Najít pouze celá slova
de: Nur ganze Wörter finden

source: Case sensitive search
cs: Dbát na psaní velkých a malých písmen
de: Groß-/Kleinschreibung beachten

source: Advanced Options
cs: Rozšířené volby
de: Erweiterte Optionen

source: Number of errors allowed:
cs: Počet povolených chyb:
de: Anzahl der erlaubten Fehler:

source: General Settings
cs: Obecná nastavení

source: Window Placement
cs: Umístění okna
de: Fensterplatzierung

source: The window is always displayed in the center of the desktop
cs: Okno se vždy zobrazuje uprostřed plochy
de: Das Fenster wird immer in der Mitte des Desktops angezeigt

source: Always center window
cs: Okno vždy na střed
de: Fenster immer zentrieren

source: The application stores its window position when exiting and reuses that on the next start
cs: Aplikace při ukončení ukládá polohu okna a opět ji použije při svém příštím spuštění
de: Die Anwendung speichert beim Beenden die Position des Fensters und stellt sie beim nächsten Start wieder her

source: Remember window position
cs: Zapamatovat si polohu okna
de: Fensterposition merken

source: Nothing special is done, the window's position is decided by KDE
cs: Aplikace přenechá umístění okna prostředí KDE
de: Die Anwendung überlässt die Positionierung des Fensters KDE

source: No special handling
cs: Nemít žádný vliv na umístění
de: Keinen Einfluß auf Positionierung nehmen

source: System Tray Icon
cs: Symbol v systémové oblasti panelu
de: Symbol im Systembereich

source: Left click translates clipboard content
cs: Levé klepnutí přeloží obsah schránky

source: Form
cs: Formulář

source: Enter the word or phrase you want to transl&ate:
cs: &Zadejte slovo nebo výraz, který chcete přeložit:

source: Se&arch word:
cs: &Hledané slovo:
de: &Suchbegriff

source: &Settings
cs: &Nastavení
de: &Einstellungen

source: searchCommandGroup
cs: Skupina příkazů pro prohledání

source: windowPlacementGroup
cs: Skupina umístění okna

source: Dictionary Lookup for KDE
cs: Hledání ve slovníku pro KDE
de: Wörterbuchsuche für KDE

source: Using dictionary version %1
cs: Používá se verze slovníku %1

# result table caption
source: German
cs: Německý

# result table caption
source: English
cs: Anglický

source: No matches found
cs: Nenalezeny žádné hodící se záznamy
de: Keine passenden Einträge gefunden

source: KDE port of Ding, the DIctionary Nice Grep
cs: Přenos Dingu do prostředí KDE, DIctionary Nice Grepu
de: KDE-Portierung von Ding, dem DIctionary Nice Grep

source: (c) 2005-2009, Michael Rex (c) 2017, Alexander Miller Dictionary (c) 1995-2016, Frank Richter
cs: (c) 2005-2009, Michael Rex (c) 2017, Alexander Miller Slovník (c) 1995-2016, Frank Richter

source: Maintainer
cs: Správce

source: Original author
cs: Původní autor
de: Ursprünglicher Autor

source: Author of Ding, for the inspiration for KDing and the dictionary
cs: Původní autor programu Ding, pro inspiraci pro KDing a slovník
de: Autor von Ding, für die Inspiration für KDing und das Wörterbuch

source: Initial port to KDE4
cs: Počáteční přenos do prostředí KDE4
de: Ursprüngliche Portierung auf KDE4

# NAME OF TRANSLATORS
source: Your names
cs: Pavel Fric
de: Michael Rex

# EMAIL OF TRANSLATORS
source: Your emails
cs: pavelfric@seznam.cz
de: me@rexi.org

source: Translate the given phrase
cs: Přeložit zadaný výraz
de: Den angegebenen Ausdruck übersetzen

source: &Translate Clipboard Content
cs: &Přeložit obsah schránky
de: Inhalt der Zwischenablage &übersetzen

source: Translates the current content of the clipboard.
cs: Přeloží nynější obsah schránky.
de: Übersetzt den aktuellen Inhalt der Zwischenablage.

source: Translate &Word...
cs: &Přeložit slovo...
de: &Wort übersetzen...

source: Opens a dialog where you can enter the word to be translated.
cs: Otevře okno, ve kterém můžete zadat slovo, které se má přeložit.
de: Öffnet ein Fenster, in dem Sie das zu übersetzende Wort eingeben können.

source: Configure &Global Shortcuts...
cs: &Nastavit všeobecné zkratky...
de: &Globale Kurzbefehle einrichten...

source: Searching for '%1'...
cs: Hledání '%1'...
de: Suche nach '%1'...

# dictionary version
source: unknown
cs: neznámý
de: unbekannt

source: KDing - Translation tool
cs: KDing - Nástroj pro překládání

source: Search cancelled.
cs: Hledání bylo zrušeno.
de: Suche abgebrochen.

source: Another search is currently running.
cs: Již běží další hledání.
de: Eine andere Suche läuft bereits.

source: Found 1 match for '%2'.
cs: Nalezen jeden hodící se výraz pro '%2'.
de: Ein passender Eintrag gefunden für '%2'.

source: Enter the word or phrase you want to translate
de: Geben Sie das Wort oder den Ausdruck ein, den Sie übersetzen möchten

source: (c) 2005-2009, Michael Rex Dictionary (c) 1995-2016, Frank Richter
de: (c) 2005-2009, Michael Rex Wörterbuch (c) 1995-2016, Frank Richter
